trade/src/InformationRegisters/ОперацииСПодключаемымОборудованием/ОперацииСПодключаемымОборудованием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперацииСПодключаемымОборудованием</name>
  <resources>
    <name>ВходящиеПараметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВходящиеПараметрыСтрока</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИсходящиеПараметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИсходящиеПараметрыСтрока</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Результат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКомпонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РевизияИнтерфейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Милисекунда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибкиСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГодМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/ОперацииСПодключаемымОборудованием/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаОтправитьВТехПоддержку.Видимость = ОбщегоНазначенияБПО.ИспользуетсяСообщенияВСлужбуТехническойПоддержки()
		И ОбщегоНазначенияБПОСлужебныйВызовСервера.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
			
	Элементы.ГруппаВыгрузитьВФайл.Видимость = Не ОбщегоНазначенияБПО.ЭтоМобильнаяПлатформа();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого Строка Из Строки Цикл
		Данные = Строка.Значение.Данные;
		Если Данные.Свойство("ВходящиеПараметры") И Данные.Свойство("ВходящиеПараметры") Тогда
			Данные.ВходящиеПараметры = ЛогированиеОперацийБПО.ФорматПараметраЛогирования(Данные.ВходящиеПараметры);
			Данные.ИсходящиеПараметры = ЛогированиеОперацийБПО.ФорматПараметраЛогирования(Данные.ИсходящиеПараметры);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Ключи = Новый Массив;
	Для Каждого КлючЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл
		Ключи.Добавить(КлючЗаписи);
	КонецЦикла;
	
	Если Ключи.Количество() = 1 Тогда
		Если ТипЗнч(Ключи[0]) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			ВремяВыполнения = 0;
		Иначе
			ВремяВыполнения = Элемент.ТекущиеДанные.ВремяВыполнения;
		КонецЕсли;
	ИначеЕсли Ключи.Количество() > 1 Тогда
		ВремяВыполнения = ВремяВыполненияОперации(Ключи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьВТехПоддержкуВыделенные(Команда)
	// Вставить содержимое обработчика.
	МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПОКлиент");
	ПараметрыСообщения = МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ПараметрыОтправкиСообщенияОбОшибке();
	
	Сведения = СведенияДляТехподдержкиВыделенные();
	Если Сведения.Количество()>0 Тогда
	
		ПараметрыВложения = Новый Структура;
		ПараметрыВложения.Вставить("Представление", НСтр("ru = 'Операции с оборудованием.txt'"));
		ПараметрыВложения.Вставить("Данные",        СтрСоединить(Сведения, Символы.ПС));
		ПараметрыВложения.Вставить("ВидДанных",     "Текст");
		ПараметрыСообщения.ДанныеВложений.Добавить(ПараметрыВложения);
		
	КонецЕсли;
	
	ПараметрыСообщения.ТекстОшибки = НСтр("ru = 'Информация о операциях с подключаемым оборудованием'");
	ОписаниеОповещения = Новый ОписаниеОповещения("СообщениеВТехническуюПоддержкуЗавершение", ЭтотОбъект);
	МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.НачатьОтправкуСообщенияОбОшибке(ОписаниеОповещения, ПараметрыСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВТехПоддержку(Команда)
	// Вставить содержимое обработчика.
	МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПОКлиент");
	ПараметрыСообщения = МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ПараметрыОтправкиСообщенияОбОшибке();
	
	Сведения = СведенияДляТехподдержки();
	Для Каждого Информация Из Сведения Цикл
	
		ПараметрыВложения = Новый Структура;
		ПараметрыВложения.Вставить("Представление", Информация.ИмяФайла);
		ПараметрыВложения.Вставить("Данные",        Информация.Данные);
		ПараметрыВложения.Вставить("ВидДанных",     "Адрес");
		ПараметрыСообщения.ДанныеВложений.Добавить(ПараметрыВложения);
		
	КонецЦикла;
	
	ПараметрыСообщения.ТекстОшибки = НСтр("ru = 'Информация о операциях с подключаемым оборудованием'");
	ОписаниеОповещения = Новый ОписаниеОповещения("СообщениеВТехническуюПоддержкуЗавершение", ЭтотОбъект);
	МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.НачатьОтправкуСообщенияОбОшибке(ОписаниеОповещения, ПараметрыСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СведенияДляТехподдержки()
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	Сведения = Новый Массив();
	Попытка
		Записи = ЗаписиПоСписку();
		ЗаписТекста = Новый ЗаписьТекста(ИмяВременногоФайла);
		Для каждого Запись Из Записи Цикл
			ЗаписТекста.ЗаписатьСтроку(СтрокаЗаписи(Запись));
		КонецЦикла;
		ЗаписТекста.Закрыть();
		МодульСообщенияВСлужбуТехническойПоддержкиБПО = 
			ОбщегоНазначенияБПО.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПО");
		Сведения = МодульСообщенияВСлужбуТехническойПоддержкиБПО.ФайлВАрхивеСРазбивкой(ИмяВременногоФайла);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияБПО.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("ru = 'БПО. Ошибка отправки сообщения в техподдержку'"), 
			СтрШаблон(НСтр("ru = 'Не удается сформировать файл с операциями: %1'"), ОписаниеОшибки),
			"Ошибка");
	КонецПопытки;
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Сведения;
	
КонецФункции

&НаСервере
Функция СведенияДляТехподдержкиВыделенные()
	
	Выборка = ВыделенныеЗаписи();
	Сведения = Новый Массив();
	Пока Выборка.Следующий() Цикл
		Сведения.Добавить(СтрокаЗаписи(Выборка));
	КонецЦикла;
	Возврат Сведения;
	
КонецФункции

&НаКлиенте
Процедура СообщениеВТехническуюПоддержкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ПустаяСтрока(Результат.КодОшибки) Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(Результат.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ВыделенныеЗаписи()
	
	ТаблицаКлючей = Новый ТаблицаЗначений();
	ТаблицаКлючей.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаКлючей.Колонки.Добавить("НомерОперации", Новый ОписаниеТипов("Число"));
	Для Каждого КлючЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТаблицаКлючей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, КлючЗаписи);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииСПодключаемымОборудованием.Оборудование КАК Оборудование,
		|	ОперацииСПодключаемымОборудованием.Дата КАК Дата,
		|	ОперацииСПодключаемымОборудованием.НомерОперации КАК НомерОперации,
		|	ОперацииСПодключаемымОборудованием.ГодМесяц КАК ГодМесяц,
		|	ОперацииСПодключаемымОборудованием.ВходящиеПараметры КАК ВходящиеПараметры,
		|	ОперацииСПодключаемымОборудованием.ИсходящиеПараметры КАК ИсходящиеПараметры,
		|	ОперацииСПодключаемымОборудованием.Результат КАК Результат,
		|	ОперацииСПодключаемымОборудованием.Таймкод КАК Таймкод,
		|	ОперацииСПодключаемымОборудованием.ТипЗаписи КАК ТипЗаписи,
		|	ОперацииСПодключаемымОборудованием.ВерсияКомпонента КАК ВерсияКомпонента,
		|	ОперацииСПодключаемымОборудованием.ВерсияДрайвера КАК ВерсияДрайвера,
		|	ОперацииСПодключаемымОборудованием.Операция КАК Операция,
		|	ОперацииСПодключаемымОборудованием.ИДУстройства КАК ИДУстройства,
		|	ОперацииСПодключаемымОборудованием.ВремяВыполнения КАК ВремяВыполнения,
		|	ОперацииСПодключаемымОборудованием.РевизияИнтерфейса КАК РевизияИнтерфейса,
		|	ОперацииСПодключаемымОборудованием.Милисекунда КАК Милисекунда,
		|	ОперацииСПодключаемымОборудованием.КодОшибки КАК КодОшибки,
		|	ОперацииСПодключаемымОборудованием.ТекстОшибки КАК ТекстОшибки,
		|	ОперацииСПодключаемымОборудованием.ВходящиеПараметрыСтрока КАК ВходящиеПараметрыСтрока,
		|	ОперацииСПодключаемымОборудованием.ИсходящиеПараметрыСтрока КАК ИсходящиеПараметрыСтрока,
		|	ОперацииСПодключаемымОборудованием.ТекстОшибкиСтрока КАК ТекстОшибкиСтрока
		|ИЗ
		|	РегистрСведений.ОперацииСПодключаемымОборудованием КАК ОперацииСПодключаемымОборудованием
		|ГДЕ
		|	(ОперацииСПодключаемымОборудованием.Дата, ОперацииСПодключаемымОборудованием.НомерОперации) В (&ТаблицаКлючей)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	НомерОперации";
	
	Запрос.УстановитьПараметр("ТаблицаКлючей", ТаблицаКлючей);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Возврат Выборка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВремяВыполненияОперации(Ключи)
	
	ТаблицаКлючей = Новый ТаблицаЗначений();
	ТаблицаКлючей.Колонки.Добавить("Оборудование", Новый ОписаниеТипов("СправочникСсылка.ПодключаемоеОборудование"));
	ТаблицаКлючей.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаКлючей.Колонки.Добавить("НомерОперации", Новый ОписаниеТипов("Число"));
	Для Каждого КлючЗаписи Из Ключи Цикл
		Если ТипЗнч(КлючЗаписи) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = ТаблицаКлючей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, КлючЗаписи);
	КонецЦикла;
	
	Если ТаблицаКлючей.Количество()=0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииСПодключаемымОборудованием.ВремяВыполнения КАК ВремяВыполнения
		|ИЗ
		|	РегистрСведений.ОперацииСПодключаемымОборудованием КАК ОперацииСПодключаемымОборудованием
		|ГДЕ
		|	(ОперацииСПодключаемымОборудованием.Оборудование, ОперацииСПодключаемымОборудованием.Дата, ОперацииСПодключаемымОборудованием.НомерОперации) В (&ТаблицаКлючей)
		|ИТОГИ
		|	СУММА(ВремяВыполнения)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ТаблицаКлючей", ТаблицаКлючей);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ВремяВыполнения = Выборка.ВремяВыполнения / 1000;
	Возврат ВремяВыполнения;
	
КонецФункции

&НаСервере
Функция СтрокаЗаписи(Запись)
	
	Возврат РегистрыСведений.ОперацииСПодключаемымОборудованием.СтрокаЗаписиЛога(Запись);
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	ТекстовыйДокумет = ВыгрузитьВФайлВсеСтрокиНаСервере();
	ТекстовыйДокумет.Показать();
КонецПроцедуры

&НаСервере
Функция ЗаписиПоСписку()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "ВходящиеПараметры";
	Поле.Поле = Новый ПолеКомпоновкиДанных("ВходящиеПараметры");
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "ИсходящиеПараметры";
	Поле.Поле = Новый ПолеКомпоновкиДанных("ИсходящиеПараметры");
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "Милисекунда";
	Поле.Поле = Новый ПолеКомпоновкиДанных("Милисекунда");
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "Дата";
	Поле.Поле = Новый ПолеКомпоновкиДанных("Дата");
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "ВходящиеПараметрыСтрока";
	Поле.Поле = Новый ПолеКомпоновкиДанных("ВходящиеПараметрыСтрока");
	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "ИсходящиеПараметрыСтрока";
	Поле.Поле = Новый ПолеКомпоновкиДанных("ИсходящиеПараметрыСтрока");

	
	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "ТекстОшибки";
	Поле.Поле = Новый ПолеКомпоновкиДанных("ТекстОшибки");

	Поле = Настройки.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Заголовок = "ТекстОшибкиСтрока";
	Поле.Поле = Новый ПолеКомпоновкиДанных("ТекстОшибкиСтрока");
	
	Настройки.Структура[0].Порядок.Элементы.Очистить();
	
	Поле = Настройки.Структура[0].Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Поле = Новый ПолеКомпоновкиДанных("Дата");
	Поле.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	Поле = Настройки.Структура[0].Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Поле.Использование = Истина;
	Поле.Поле = Новый ПолеКомпоновкиДанных("НомерОперации");
	Поле.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецФункции

&НаСервере
Функция ВыгрузитьВФайлВсеСтрокиНаСервере()

	#Если Не МобильноеПриложениеСервер Тогда
	Записи = ЗаписиПоСписку();
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Для каждого Запись Из Записи Цикл
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаписи(Запись));
	КонецЦикла;
	
	Возврат ТекстовыйДокумент;
	#КонецЕсли
	
КонецФункции

&НаСервере
Функция ВыгрузитьВФайлВыделенныеСтрокиНаСервере()

	#Если Не МобильноеПриложениеСервер Тогда
	Выборка = ВыделенныеЗаписи();
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Пока Выборка.Следующий() Цикл
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаписи(Выборка));
	КонецЦикла;
	
	Возврат ТекстовыйДокумент;
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайлВыделенные(Команда)
	ТекстовыйДокумет = ВыгрузитьВФайлВыделенныеСтрокиНаСервере();
	ТекстовыйДокумет.Показать();
КонецПроцедуры

#КонецОбласти
